In [15]:
# Importing Dependencies
import pandas as pd
import os
from sqlalchemy import create_engine

# Extract - Storing CSV into DataFrame

In [16]:
# Creating csv path and loading first data in Pandas DataFrame
csv_path = ("data/world_pop.csv")
wrld_pop_df = pd.read_csv(csv_path)
wrld_pop_df.head()

,Rank,name,pop2022,pop2021,GrowthRate,area,Density,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,1.0,China,1425887.337,1425893.465,0.00,9706961.0,147.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2.0,India,1417173.173,1407563.842,0.68,3287590.0,431.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3.0,United States,338289.857,336997.624,0.38,9372610.0,36.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4.0,Indonesia,275501.339,273753.191,0.64,1904569.0,145.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5.0,Pakistan,235824.862,231402.117,1.91,881912.0,267.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
# Renaming Country Name column
mapping = {wrld_pop_df.columns[1]:'id'}
transformed_data = wrld_pop_df.rename(columns=mapping)
transformed_data.head()

,Rank,id,pop2022,pop2021,GrowthRate,area,Density,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,1.0,China,1425887.337,1425893.465,0.00,9706961.0,147.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2.0,India,1417173.173,1407563.842,0.68,3287590.0,431.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3.0,United States,338289.857,336997.624,0.38,9372610.0,36.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4.0,Indonesia,275501.339,273753.191,0.64,1904569.0,145.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5.0,Pakistan,235824.862,231402.117,1.91,881912.0,267.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [23]:
# Creating csv path and loading first data in Pandas DataFrame
csv_path = ("data/world_coordinatees.csv")
wrld_coord_df = pd.read_csv(csv_path)
wrld_coord_df.head()

,country_code,latitude,longitude,country,usa_state_code,usa_state_latitude,usa_state_longitude,usa_state
0,AD,42.546245,1.601554,Andorra,AK,63.588753,-154.493062,Alaska
1,AE,23.424076,53.847818,United Arab Emirates,AL,32.318231,-86.902298,Alabama
2,AF,33.939110,67.709953,Afghanistan,AR,35.201050,-91.831833,Arkansas
3,AG,17.060816,-61.796428,Antigua and Barbuda,AZ,34.048928,-111.093731,Arizona
4,AI,18.220554,-63.068615,Anguilla,CA,36.778261,-119.417932,California

In [26]:
# making the country column as the first column

first_column = wrld_coord_df.pop('country')
  
# insert column using insert(position,column_name,
# first_column) function
wrld_coord_df.insert(0, 'country', first_column)

wrld_coord_df

,country,country_code,latitude,longitude,usa_state_code,usa_state_latitude,usa_state_longitude,usa_state
0,Andorra,AD,42.546245,1.601554,AK,63.588753,-154.493062,Alaska
1,United Arab Emirates,AE,23.424076,53.847818,AL,32.318231,-86.902298,Alabama
2,Afghanistan,AF,33.939110,67.709953,AR,35.201050,-91.831833,Arkansas
3,Antigua and Barbuda,AG,17.060816,-61.796428,AZ,34.048928,-111.093731,Arizona
4,Anguilla,AI,18.220554,-63.068615,CA,36.778261,-119.417932,California
...,...,...,...,...,...,...,...,...
240,Yemen,YE,15.552727,48.516388,NaN,NaN,NaN,NaN
241,Mayotte,YT,-12.827500,45.166244,NaN,NaN,NaN,NaN
242,South Africa,ZA,-30.559482,22.937506,NaN,NaN,NaN,NaN
243,Zambia,ZM,-13.133897,27.849332,NaN,NaN,NaN,NaN
244,Zimbabwe,ZW,-19.015438,29.154857,NaN,NaN,NaN,NaN

In [29]:
# Renaming Country Name column
mapping = {wrld_coord_df.columns[0]:'id'}
transformed_data_df = wrld_coord_df.rename(columns=mapping)
transformed_data_df.head()

,id,country_code,latitude,longitude,usa_state_code,usa_state_latitude,usa_state_longitude,usa_state
0,Andorra,AD,42.546245,1.601554,AK,63.588753,-154.493062,Alaska
1,United Arab Emirates,AE,23.424076,53.847818,AL,32.318231,-86.902298,Alabama
2,Afghanistan,AF,33.939110,67.709953,AR,35.201050,-91.831833,Arkansas
3,Antigua and Barbuda,AG,17.060816,-61.796428,AZ,34.048928,-111.093731,Arizona
4,Anguilla,AI,18.220554,-63.068615,CA,36.778261,-119.417932,California

# Data Cleaning and Transformation

In [8]:
# Creating a filtered dataframe from specific columns

transformed_data_cols = ['Rank', 'id', 'pop2022', 
                 'pop2021', 'GrowthRate', 'Density']

world_population = transformed_data[transformed_data_cols].copy()

# Clean the data by dropping duplicates and setting the index
world_population.drop_duplicates()

# Drop the index column
world_population = world_population.reset_index(drop=True)

world_population.head()

   Rank             id      pop2022      pop2021  GrowthRate  Density
0   1.0          China  1425887.337  1425893.465        0.00    147.0
1   2.0          India  1417173.173  1407563.842        0.68    431.0
2   3.0  United States   338289.857   336997.624        0.38     36.0
3   4.0      Indonesia   275501.339   273753.191        0.64    145.0
4   5.0       Pakistan   235824.862   231402.117        1.91    267.0

In [30]:
# Creating a filtered dataframe from specific columns

transformed_data_df_cols = ['id', 'latitude', 'longitude']

country_coordinates = transformed_data_df[transformed_data_df_cols].copy()

# Clean the data by dropping duplicates and setting the index
country_coordinates.drop_duplicates()

# Drop the index column
country_coordinates = country_coordinates.reset_index(drop=True)

country_coordinates.head()

                     id   latitude  longitude
0               Andorra  42.546245   1.601554
1  United Arab Emirates  23.424076  53.847818
2           Afghanistan  33.939110  67.709953
3   Antigua and Barbuda  17.060816 -61.796428
4              Anguilla  18.220554 -63.068615

# Connecting to local database

In [9]:
# Connecting to local database

protocol = 'postgresql'
username = '<postgres>'
password = '<akinbola1984>'
host = 'localhost'
port = 5432
database_name = 'wrld_population_db'
rds_connection_string = f'{protocol}://{username}:{password}@{host}:{port}/{database_name}'
#engine = create_engine(rds_connection_string)
engine = create_engine('postgresql+psycopg2://postgres:akinbola1984@localhost/wrld_population_db')

In [32]:
# Checking for tables

engine.table_names()

/Users/ola/opt/anaconda3/envs/PythonData/lib/python3.7/site-packages/ipykernel_launcher.py:3: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  This is separate from the ipykernel package so we can avoid doing imports until

['world_population', 'world_coordinates']

# Using pandas to load csv converted DataFrame into database

In [11]:
# Loading the reported_cases csv dataframe into prosgresql table

world_population.to_sql(name='world_population', con=engine, if_exists='replace', index=False)

In [31]:
# Loading the reported_cases csv dataframe into prosgresql table

country_coordinates.to_sql(name='world_coordinates', con=engine, if_exists='replace', index=False)

# Confirming data has been added by querying the world population table

In [12]:
# Dispalying the reported_cases table from the prosgresql database

pd.read_sql_query('select * from world_population', con=engine).head()

   Rank             id      pop2022      pop2021  GrowthRate  Density
0   1.0          China  1425887.337  1425893.465        0.00    147.0
1   2.0          India  1417173.173  1407563.842        0.68    431.0
2   3.0  United States   338289.857   336997.624        0.38     36.0
3   4.0      Indonesia   275501.339   273753.191        0.64    145.0
4   5.0       Pakistan   235824.862   231402.117        1.91    267.0

In [33]:
# Dispalying the reported_cases table from the prosgresql database

pd.read_sql_query('select * from world_coordinates', con=engine).head()

                     id   latitude  longitude
0               Andorra  42.546245   1.601554
1  United Arab Emirates  23.424076  53.847818
2           Afghanistan  33.939110  67.709953
3   Antigua and Barbuda  17.060816 -61.796428
4              Anguilla  18.220554 -63.068615

In [13]:
# Exporting Pandas DataFrame into csv
os.makedirs('data', exist_ok=True)  
world_population.to_csv('data/world_population.csv', index=False)
world_coordinates.to_csv('data/world_coordinates.csv', index=False)